<template>
  <div class="container">
    <div class="about bg-dark text-white">
      <h1>Пересоздайте Giphy с собственным API -> https://giphy.com/</h1>
      <h5>
        <p class="text-start">
        Задача: написать веб-приложение, которое показывает гифки на странице, с использованием пользовательского ввода для поиска и API Giphy.
        Когда освоите манипулирование с объектной моделью документа и возьмётесь за работу с обыкновенными JavaScript или jQuery, рекомендуем начать изучение шаблонов данных и показывать их в дереве DOM.
        Для старта разработайте начальное приложение – базовое воссоздание сайта Giphy с использованием Giphy API. Нативный API подходит для начинающих, потому что не требует никакого ключа API, и вам не придётся беспокоиться о конфигурации при попытке запросить данные.
        </p>
        <p class="text-start">
          С использованием API вы напишите небольшое веб-приложение, которое выполняет такие функции:
          при запуске отображает актуальные GIF-файлы в колонке или сетке;
          принимает ввод пользователя для поиска конкретных картинок;
          в нижней части после результатов отображается кнопка «Загрузить ещё», которая получает дополнительную порцию гифок по тому же ключевому слову.

          Во время разработки вы столкнётесь с массой новых задач, например, со способами работы с асинхронными запросами. Выбирайте обычный JavaScript для этой задачи или, если предпочитаете jQuery, используйте метод ajax. Цель заключается в том, чтобы начать работать с асинхронным кодом.
          По мере того как приложение становится сложнее, также подумайте о способе сохранения данных в нём и организации. Для этого рекомендуем использовать архитектурный шаблон, называемый пространством имён. Он поможет в борьбе с областью видимости и конфликтами с замыканиями.
        </p>
      </h5>
    </div>
  </div>
</template>

<style>
.about {
  height: 100vh;
}
</style>
